00test/Laser_3D_Stellite_Inconel_distribution1/constant/LaserProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      PhaseFieldProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ============================================================
// Gaussian Laser Beam Model
// Formula: I(x,r) = (2*P)/(pi*Rb(x)^2) * exp(-2*r^2/Rb(x)^2)
//   x : axial distance along laserDirection from laserOrigin
//   r : radial distance from laser axis
//   Rb(x): effective beam radius varying along x
// ============================================================

// ============================================================
// Moving Laser Head (for transient scanning simulations)
// laserInitialPosition + laserVelocity*t gives laser head position at time t
// ============================================================
laserInitialPosition (0.0 0.0 0.0);
laserVelocity        (0.0 0.0 0.0);


// --- Direction & Origin ---
// laserDirection: unit vector of laser propagation (normalised in code)
// Examples: (0 -1 0) = downward along -Y, (0 0 -1) = along -Z
laserDirection      (1 0 0);

// laserOrigin: reference point on the laser axis where x=0 (e.g. nozzle exit)
laserOrigin         (0.0 0.0 0.0);

// --- Power ---
// laserPower: total laser power P [W]
laserPower          300.0;

// --- Beam Radius Profile Rb(x) ---
// The beam converges to a minimum radius at the focal point,
// is flat within the depth-of-field (DOF), then diverges symmetrically.
//
// Let:
//   xf  = focalDistance        (axial position of focal point)
//   DOF = depthOfField         (length of flat-focus zone)
//   R0  = beamRadiusMin        (minimum beam radius at focal zone)
//   theta = halfAngle          (convergence/divergence half-angle)
//
// Define the DOF zone: [xf - DOF/2,  xf + DOF/2]
//
//         / R0 + (xf - DOF/2 - x) * tan(theta),   x < xf - DOF/2   (converging)
// Rb(x) = | R0,                                    xf - DOF/2 <= x <= xf + DOF/2   (flat)
//         \ R0 + (x - xf - DOF/2) * tan(theta),   x > xf + DOF/2   (diverging)
//
// Equivalently (compact form):
//   dist_to_DOF = max(0,  xf - DOF/2 - x)   [upstream of DOF]
//               + max(0,  x - xf - DOF/2)   [downstream of DOF]
//   Rb(x) = R0 + dist_to_DOF * tan(theta)
//
// beamRadiusMin: minimum (focal) beam radius R_b0 [m]  (e.g. 0.75 mm)
beamRadiusMin       7.5e-4;

// halfAngle: beam convergence/divergence half-angle [rad]  (3.7 deg = 0.06458 rad)
halfAngle           0.06458;

// focalDistance: axial distance from laserOrigin to focal point [m]  (e.g. 8.5 mm)
focalDistance       8.5e-3;

// depthOfField: length of the flat-focus zone (DOF) [m]  (e.g. 5 mm)
depthOfField        5.0e-3;


// ============================================================
// Laser Attenuation Parameters (Beer-Lambert law)
// ============================================================
// Enable/disable laser attenuation due to particle absorption & scattering
enableAttenuation   false;

// extinctionEfficiency: Qext = Qabs + Qsca (dimensionless)
// Typical values: 1.5-3.0 for metallic particles at laser wavelength
// Geometric optics limit (d >> lambda): Qext -> 2
extinctionEfficiency 2.0;
